[Executable without EXE/DLL extension]
counttype = number of events
description = Searches for executable images that do not have a .EXE or .DLL at the end of the observed filename.
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
quantity = 0
relation = greater than
search = `cb` "docs{}.is_executable_image"=true\
docs{}.os_type="Windows"\
NOT docs{}.observed_filename="*.exe" \
NOT docs{}.observed_filename="*.dll" \
NOT docs{}.observed_filename="*.sys" \
NOT docs{}.observed_filename="*Library/Application Support/Spigot/ApplicationManager"\
| stats count by cb_server, docs{}.md5, watchlist_name, docs{}.observed_filename

[Powershell.exe DownloadFile]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb`  process=powershell.exe DownloadFile| stats values(command_line) as "commands" by computer_name

[bcdedit.exe off]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process_path_name=bcdedit.exe off | stats values(command_line) as "commands" by computer_name

[cmd.exe reg add]
dispatch.earliest_time = @w0
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=cmd.exe "reg add" NOT citrix NOT dinocapture| stats values(command_line) as "commands" by computer_name

[cmd.exe schtasks]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=cmd.exe schtasks NOT WizMouse| stats values(command_line) as "commands" by computer_name

[cmd.exe schtasks appdata]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=cmd.exe schtasks appdata NOT WizMouse| stats values(command_line) as "commands" by computer_name

[mshta.exe abuse]
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=mshta.exe NOT *.hta| stats values(command_line) as "commands" by computer_name

[net.exe IPC$]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=net.exe *ipc$*| stats values(command_line) as "commands" by computer_name

[netview.exe usage]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=netview.exe | stats values(command_line) as "commands" by computer_name

[ntdsutil.exe]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=ntdsutil.exe NOT svcdsrm| stats values(command_line) as "commands" by computer_name

[qwinsta.exe usage]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=qwinsta.exe | stats values(command_line) as "commands" by computer_name

[regsvr32.exe jpg - banload]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=regsvr32.exe command_line=*.jpg* | stats values(command_line) as "commands" by computer_name

[regsvr32.exe programdata]
description = Vawtrak
dispatch.earliest_time = @d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=regsvr32.exe "\\programdata\\"| stats  values(command_line) as "commands" by computer_name

[rundll32.exe wow.dll - tranwos]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process_path_name=rundll32.exe command_line=*wow.dll* | stats values(command_line) as "commands" by _time,computer_name

[watchdogproc]
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` command_line=watchdogproc*| stats values(command_line) as "commands" by computer_name

[winword.exe invoice]
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process_path_name=winword.exe Outlook\\ \\invoice*.doc  | bucket _time span=1d | stats values(command_line) as "comamnds" by computer_name

[wscript.exe ..vbs vbe]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=wscript.exe command_line=*..vbs* OR command_line=*.vbe* NOT SUBSCRIPTS NOT Loginscript.vbe | stats values(command_line) as "commands" by _time,computer_name

[regsvr32.exe appdata]
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=regsvr32.exe "\\AppData\\"| stats  values(command_line) as "commands" by computer_name

[rundll32.exe Control_RunDLL]
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=rundll32.exe command_line="*,Control_RunDLL" | bucket _time span=1d | stats values(command_line) as "comamnds" by computer_name

[Signatures - Signed and executed when]
dispatch.earliest_time = @d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` ioc_type=md5 | stats  values("docs{}.digsig_sign_time")  by "docs{}.last_seen","docs{}.alliance_score_virustotal","docs{}.alliance_link_virustotal"

[rundll32.exe DLLRegisterServer]
dispatch.earliest_time = @w0
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=rundll32.exe DllRegisterServer NOT command_line="*xapauthenticodesip.dll*" | bucket _time span=1d | stats values(command_line) as "comamnds" by computer_name

[cmd.exe programdata bat]
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=cmd.exe \\programdata\\ .bat NOT bginfo NOT onconnect NOT biomedical NOT goloader NOT kace| stats values(command_line) by computer_name

[Suspicious Bitsadmin.exe]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=bitsadmin.exe | stats values(command_line) by computer_name

[powershell.exe encoded command]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=powershell.exe -enc OR -encodedcommand| stats values(command_line) as "commands" by computer_name

[netsh.exe opmode]
dispatch.earliest_time = @w0
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=netsh.exe command_line="*opmode*"| stats values(command_line) as "commands" by computer_name

[psexec.exe usage]
dispatch.earliest_time = @w0
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=psexec.exe | stats values(command_line) as "commands" by computer_name

[rundll32.exe Roaming]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=rundll32.exe Roaming NOT shopenverbshortcut | stats values(command_line) as "commands" by computer_name

[vssadmin.exe delete]
dispatch.earliest_time = @w0
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process_path_name=vssadmin.exe delete| stats values(command_line) as "commands" by computer_name

[DNSUnlocker]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` "dns unlocker" OR "dnsunlocker"  type="ingress.event.procstart" OR type="ingress.event.filemod" | stats  values(process) by computer_name

[Possible Spamming]
dispatch.earliest_time = @d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` port=25 OR port=587  direction=outbound |stats count values(port) by computer_name

[cscript HTTP]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=cscript.exe http | stats values(command_line) as commands by computer_name

[wscript js]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=wscript.exe .js NOT updt.js NOT genius.js NOT uwgm_client.js NOT wimaxpro.js | stats values(command_line) by computer_name,cb_server,username,_time

[Cryptowall - vssadmin delete shadows]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
search = `cb` command_line="vssadmin.exe Delete Shadows /All /Quiet" OR command_line="\"C:\\Windows\\System32\\vssadmin.exe\"  Delete Shadows /All /Quiet " | stats values(command_line) as "commands" by computer_name,process,link_parent

[Powershell.exe iex]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=powershell.exe iex  earliest = -1h| stats values(command_line) as "commands" by computer_name

[net use user]
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=net.exe net use user| stats count values(command_line) by computer_name,username

[JS Ransomware]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=wscript.exe \\Rar$*\\  OR ".zip" \\appdata\\ | stats values(command_line) by computer_name

[WMIC shadowcopy or delete]
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=wmic.exe shadowcopy OR delete

[CBER Risky Assets]
dispatch.earliest_time = -4h@m
dispatch.latest_time = now
dispatchAs = user
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = visualizations
display.visualizations.charting.chart = line
search = | tstats latest(_time) as _time, values(CbR_Alert.watchlist_name) as watchlist, values(CbR_Alert.feed_name) as feed, values(CbR_Alert.ioc_value) as ioc from datamodel=CbResponse by CbR_Alert.computer_name\
| eval risk = 1\
| eval risk = case(count>0,risk+10, 1==1, risk)\
| eval risk = case(count>3,risk+10, 1==1, risk)\
| eval risk = case(count>5,risk+10, 1==1, risk)\
| eval risk = case(count>10,risk+10, 1==1, risk)\
| eval risk = case(count>15,risk+10, 1==1, risk)\
| eval risk = case(count>20,risk+10, 1==1, risk)\
| eval risk = case(count>25,risk+10, 1==1, risk)\
| eval risk = case(count>30,risk+10, 1==1, risk)\
| eval risk = case(count>35,risk+10, 1==1, risk)\
| eval risk = case(count>40,risk+10, 1==1, risk)\
| eval risk = case(feed=="virustotal", risk+1, 1==1, risk)\
| eval risk = case(watchlist=="Regsvr32 w/Netconns", risk+15, 1==1, risk)\
| eval risk = case(watchlist=="process_blocking", risk+100, 1==1, risk)\
| eval risk = case(watchlist=="zbot - powershell iex", risk+30, 1==1, risk)\
| eval risk = case(feed=="alienvault", risk+5, 1==1, risk)\
| eval risk = case(feed=="bit9endpointvisibility", risk+5, 1==1, risk)\
| eval risk = case(feed=="bit9suspiciousindicators", risk+5, 1==1, risk)\
| eval risk = case(feed=="tor", risk+10, 1==1, risk)\
| eval risk = case(feed=="iconmatching", risk+1, 1==1, risk)\
| streamstats count(feed) as feed_count by CbR_Alert.computer_name\
| streamstats count(watchlist) as wl_count by CbR_Alert.computer_name\
| streamstats count(ioc) as ioc_count by CbR_Alert.computer_name

[Risky Systems - 70+]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = | tstats latest(_time) as _time, values(CbR_Alert.watchlist_name) as watchlist, values(CbR_Alert.feed_name) as feed, values(CbR_Alert.ioc_value) as ioc from datamodel=CbResponse by CbR_Alert.computer_name\
| eval risk = 1\
| eval risk = case(count>0,risk+10, 1==1, risk)\
| eval risk = case(count>3,risk+10, 1==1, risk)\
| eval risk = case(count>5,risk+10, 1==1, risk)\
| eval risk = case(count>10,risk+10, 1==1, risk)\
| eval risk = case(count>15,risk+10, 1==1, risk)\
| eval risk = case(count>20,risk+10, 1==1, risk)\
| eval risk = case(count>25,risk+10, 1==1, risk)\
| eval risk = case(count>30,risk+10, 1==1, risk)\
| eval risk = case(count>35,risk+10, 1==1, risk)\
| eval risk = case(count>40,risk+10, 1==1, risk)\
| eval risk = case(feed=="virustotal", risk+1, 1==1, risk)\
| eval risk = case(watchlist=="Regsvr32 w/Netconns", risk+15, 1==1, risk)\
| eval risk = case(watchlist=="process_blocking", risk+100, 1==1, risk)\
| eval risk = case(watchlist=="zbot - powershell iex", risk+30, 1==1, risk)\
| eval risk = case(feed=="alienvault", risk+5, 1==1, risk)\
| eval risk = case(feed=="bit9endpointvisibility", risk+5, 1==1, risk)\
| eval risk = case(feed=="bit9suspiciousindicators", risk+5, 1==1, risk)\
| eval risk = case(feed=="tor", risk+10, 1==1, risk)\
| eval risk = case(feed=="iconmatching", risk+1, 1==1, risk)\
| streamstats count(feed) as feed_count by CbR_Alert.computer_name\
| streamstats count(watchlist) as wl_count by CbR_Alert.computer_name\
| streamstats count(ioc) as ioc_count by CbR_Alert.computer_name\
|where risk>70

[wscript vbe or vbs]
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=wscript.exe command_line=*..vbs* OR command_line=*.vbe* NOT SUBSCRIPTS NOT Loginscript.vbe | table computer_name, username, command_line, link_process, _time

[DNS Unlocker]
counttype = number of events
dispatch.earliest_time = -1d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` "dns unlocker" OR "dnsunlocker"  type="ingress.event.procstart" OR type="ingress.event.filemod" | table computer_name, username, path, link_process, _time

[Vawtrak domains]
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.visualizations.charting.chart = bar
quantity = 0
relation = greater than
search = `cb` finehotels.net OR helloalliance.net OR camelcap.com OR guesstrade.com OR mgsmedia.ru OR memiepi.com OR hiesook.net OR heapeih.net OR raveiv.com OR raveiver.com OR seviv.net OR zooreizei.net OR mefealo.net OR geimal.net OR ceazivie.net OR tozosei.net OR ziefisea.net OR negut.net OR heepoom.net OR neimucher.net OR nikeifi.com OR teaseeras.com OR ciroxi.com OR zeileagei.net OR cookitie.net OR pooxete.net

[x.bat bitsadmin]
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=cmd.exe \\programdata\\ x.bat NOT bginfo NOT onconnect NOT biomedical NOT goloader NOT kace | table computer_name, username, command_line, link_process, _time

[Ransomware]
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` command_line="vssadmin.exe Delete Shadows /All /Quiet" OR command_line="\"C:\\Windows\\System32\\vssadmin.exe\"  Delete Shadows /All /Quiet " | table computer_name, username, command_line, link_process, _time

[Ransomware JS]
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=wscript.exe \\Rar$*\\  OR ".zip" \\appdata\\ | table computer_name, username, command_line, link_process, _time

[Rundll32.exe DLLRegisterServer]
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=rundll32.exe DllRegisterServer NOT command_line="*xapauthenticodesip.dll*" NOT veraport20.dll NOT \\devmcopy\\| table computer_name, username, command_line, link_process, _time

[Wscript Execution]
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.page.search.mode = verbose
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=wscript.exe command_line=*..vbs* OR command_line=*.vbe* NOT SUBSCRIPTS NOT Loginscript.vbe

[mshta.exe javascript]
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
quantity = 0
relation = greater than
search = `cb` process=mshta.exe javascript:*| head limit=1 | table computer_name, username, command_line, link_process, _time

[Powershell Encoded]
counttype = number of events
description = Powershell Encoded Command
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=powershell.exe -enc OR -encodedcommand | table computer_name, username, command_line, link_process, _time
